---
kind: other
id: Methods.T:Autodesk.Revit.DB.PlanarFace
source: html/f8fb1556-4c26-a3b5-a474-ddde3a2f7306.htm
---
# PlanarFace Methods

Returns the first partial derivatives of the underlying surface at the specified point.